#+TITLE: Solving Leetcode problems in Golang

* DONE 46. Permutations                                              :Medium:
CLOSED: [2021-07-26 Mon 10:46]
<2021-07-25 Sun>

Heap's algorithm generates all possible permutations of n objects. It
was first proposed by B. R. Heap in 1963.

#+begin_src python :results verbatim
output = []
a = [1, 2, 3]
n = len(a)

def heapPermutation(a, size):

    # if size becomes 1 then prints the obtained
    # permutation
    if size == 1:
        output.append(a)
        return

    for i in range(size):

        # if size is odd, swap 0th i.e (first)
        # and (size-1)th i.e (last) element
        # else If size is even, swap ith
        # and (size-1)th i.e (last) element
        idx = 0 if (size & 1) else i
        a[idx], a[size-1] = a[size-1], a[idx]
        heapPermutation(a, size-1)

# Driver code
heapPermutation(a, n)
return output

#+end_src

#+RESULTS:
: [[1, 2, 3], [1, 2, 3], [1, 2, 3], [1, 2, 3], [1, 2, 3], [1, 2, 3]]


#+begin_src go
func heapPermutations(data []int) [][]int {
	permutations := [][]int{}
	var generate func(int, []int)

	generate = func(n int, arr []int) {
		if n == 1 {
			A := make([]int, len(p))
			copy(A, p)
			permutations = append(permutations, A)
		} else {
			for i := 0; i < n; i++ {
				generate(n-1, arr)
				idx := 0
				if n%2 == 0 {
					idx = i
				}
				arr[idx], arr[n-1] = arr[n-1], arr[idx]
			}
		}
	}
	generate(len(data), data)
	return permutations
}

heapPermutations([]int{1, 2, 3})
#+end_src
